Tekla Open API Reference for Tekla Structures 2025
AnalysisVolume Properties
The AnalysisVolume type exposes the following members.
Properties
Name | Description
AnalysisModelName
 Gets or sets the analysis model name.
 (Inherited from AnalysisObject.)
AnalysisObjectType
 Gets or sets the type of the analysis object.
 (Inherited from AnalysisObject.)
FatherObject2ID
 Gets or sets the identifier of the father part.
 (Inherited from AnalysisObject.)
FatherObject2Type
 Gets or sets the type of the father object.
 (Inherited from AnalysisObject.)
FatherObjectID
 Gets or sets the identifier of the father part.
 (Inherited from AnalysisObject.)
FatherObjectType
 Gets or sets the type of the father object.
 (Inherited from AnalysisObject.)
ID
 Gets or sets the identifier of the analysis object.
 (Inherited from AnalysisObject.)
Material
 The material of the analysis volume.
Profile
 The profile of the analysis volume.
Volume
 The volume item.
VolumeHoles
 The volume holes.
Top
See Also
Reference
AnalysisVolume Class
Tekla.Structures.Analysis Namespace